# range의 다양한 기능을 활용
# 시작하는 숫자와 끝나는 숫자 지정
# range에 시작하는 숫자와 끝나는 숫자를 지정해서 반복

for i in range(5,12): # 5~11까지 출력
    print(i, "hello, world")

# 증가폭사용(짝수만)
print("증가폭 사용(짝수)")
for i in range(0,10,2):
    print(i, "hello world!")
print("======================================분리선======================================")

# 증가폭사용(홀수만)
print("증가폭 사용(홀수)")
for i in range(1,10,2):
    print(i,"hello world!")
print("======================================분리선======================================")


# if문으로 홀수만 출력
print("for,range,if문 사용(홀수)")
for i in range(0,10):
    if i%2!=0:
        print(i,"hello, world!")
print("======================================분리선======================================")
# 숫자 감소
print("숫자감소")
for i in range(10,0, -1):
    print(i, "hello world!")
print("======================================분리선======================================")

# 숫자감소 (짝수)
print("숫자감소(짝수)")
for i in range(10,0, -2):
    print(i, "hello world!")
print("======================================분리선======================================")

# 숫자감소 (홀수)
print("숫자감소(홀수)")
for i in range(9,0, -2):
    print(i, "hello world!")
print("======================================분리선======================================")


# reversed를 이용한 숫자 감소
print("reversed를 이용한 숫자 감소")
for i in reversed(range(10)):
    print(i+1,"hello, world!")
print("======================================분리선======================================")


# reversed에 시작값과 끝값을 입력하여 숫자 감소
print("reversed에 시작값과 끝값을 입력하여 숫자 감소")
for i in reversed(range(1,10)):
    print(i, "hello, world!")
print("======================================분리선======================================")

# reversed에 시작값, 끝값, 폭 입력하여 숫자 감소
print("reversed에 시작값, 끝값, 폭 입력하여 숫자 감소")
for i in reversed(range(1,10,2)):
    print(i, "hello, world!")
print("======================================분리선======================================")

# 입력한 횟수대로 반복
print("입력한 횟수대로 반복")
count = int(input("반복할 횟수 입력: "))
for i in range(count):
    print(i+1, "hello world!")
print("======================================분리선======================================")